onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АК_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.АК_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>АК_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	// *****
	//Kudryashova: Проверка общего % скидок 
	//РассчитатьСуммуСтроки(ТекущиеДанные);
	Если ТекущиеДанные.Скидка + Объект.АК_СогласованнаяСкидка > 100 Тогда
		ТекущиеДанные.Сумма = 0;
		ИмяТаблицы = Элементы.Товары.Имя;
		НомерСтроки = ТекущиеДанные.НомерСтроки - 1;
		НоменклатурнаяПозиция = ТекущиеДанные.Номенклатура;
		ВывестиСообщениеОПревышенииСкидки(ИмяТаблицы, НомерСтроки, НоменклатурнаяПозиция);
	Иначе
		РассчитатьСуммуСтроки(ТекущиеДанные);
	КонецЕсли;
	// *****
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	// *****
	//Kudryashova: Проверка общего % скидок 
	//РассчитатьСуммуСтроки(ТекущиеДанные);
	Если ТекущиеДанные.Скидка + Объект.АК_СогласованнаяСкидка > 100 Тогда
		ТекущиеДанные.Сумма = 0;
		ИмяТаблицы = Элементы.Услуги.Имя;
		НомерСтроки = ТекущиеДанные.НомерСтроки - 1;
		НоменклатурнаяПозиция = ТекущиеДанные.Номенклатура;
		ВывестиСообщениеОПревышенииСкидки(ИмяТаблицы, НомерСтроки, НоменклатурнаяПозиция);
	Иначе
		РассчитатьСуммуСтроки(ТекущиеДанные);
	КонецЕсли;
	// *****
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура АК_СогласованнаяСкидкаПриИзменении(Элемент)

	// *****
	//Kudryashova: Добавление события при изменении скидки
	Если Объект.Товары.Количество() = 0 И Объект.Услуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Выполнить пересчет табличных частей с учётом скидки?'"),
		РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ПересчитатьТабличныеЧастиСоСкидкой();
		КонецЕсли;
		
	РассчитатьСуммуДокумента();
	// *****
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПересчитатьСоСкидкой(Команда)
	
	// *****
	//Kudryashova: Добавление обработчика команды пересчета со скидкой
	ПересчитатьТабличныеЧастиСоСкидкой();

	РассчитатьСуммуДокумента();
	// *****
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// *****
	//Kudryashova: Расчет коэффициента скидки с учетом общей скидки
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	КоэффициентСкидки = 1 - (ТекущиеДанные.Скидка + Объект.АК_СогласованнаяСкидка) / 100;
	// *****
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ПересчитатьТабличныеЧастиСоСкидкой()
	
	// *****
	//Kudryashova: Пересчет таблиц с общей скидкой
	Для Каждого Строка Из Объект.Товары Цикл
		Если Строка.Скидка + Объект.АК_СогласованнаяСкидка > 100 Тогда
			Строка.Сумма = 0;
			ИмяТаблицы = "Товары";
			НомерСтроки = Строка.НомерСтроки - 1;
			НоменклатурнаяПозиция = Строка.Номенклатура;
			ВывестиСообщениеОПревышенииСкидки(ИмяТаблицы, НомерСтроки, НоменклатурнаяПозиция);
		Иначе
			РассчитатьСуммуСтроки(Строка);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Строка Из Объект.Услуги Цикл
		Если Строка.Скидка + Объект.АК_СогласованнаяСкидка > 100 Тогда
			Строка.Сумма = 0;
			ИмяТаблицы = "Услуги";
			НомерСтроки = Строка.НомерСтроки - 1;
			НоменклатурнаяПозиция = Строка.Номенклатура;
			ВывестиСообщениеОПревышенииСкидки(ИмяТаблицы, НомерСтроки, НоменклатурнаяПозиция);
		Иначе
			РассчитатьСуммуСтроки(Строка);
		КонецЕсли;
	КонецЦикла;
	// *****

КонецПроцедуры

&НаКлиенте
Процедура ВывестиСообщениеОПревышенииСкидки(ИмяТаблицы, НомерСтроки, НоменклатурнаяПозиция)
	
	// *****
	//Kudryashova: ВыводСообщенияОПревышенииСкидки
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон("Общий процент скидки по номенклатуре %1 превышает 100", НоменклатурнаяПозиция);
	Сообщение.КлючДанных = Объект.Ссылка;
	Сообщение.ПутьКДанным = "Объект";
	Сообщение.Поле = ИмяТаблицы + "[" + НомерСтроки + "].Скидка";
	Сообщение.Сообщить();
	// *****

КонецПроцедуры

#КонецОбласти
